XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/mm_misc_reg.h
/**
  ******************************************************************************
  * @file    mm_misc_reg.h
  * @version V1.0
  * @date    2021-07-12
  * @brief   This file is the description of.IP register
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef __MM_MISC_REG_H__
#define __MM_MISC_REG_H__

#include "bl606p.h"

/* 0x0 : CPU0_Boot */
#define MM_MISC_CPU0_BOOT_OFFSET   (0x0)
#define MM_MISC_REG_CPU0_RVBA      MM_MISC_REG_CPU0_RVBA
#define MM_MISC_REG_CPU0_RVBA_POS  (0U)
#define MM_MISC_REG_CPU0_RVBA_LEN  (32U)
#define MM_MISC_REG_CPU0_RVBA_MSK  (((1U << MM_MISC_REG_CPU0_RVBA_LEN) - 1) << MM_MISC_REG_CPU0_RVBA_POS)
#define MM_MISC_REG_CPU0_RVBA_UMSK (~(((1U << MM_MISC_REG_CPU0_RVBA_LEN) - 1) << MM_MISC_REG_CPU0_RVBA_POS))

/* 0x8 : CPU_cfg */
#define MM_MISC_CPU_CFG_OFFSET         (0x8)
#define MM_MISC_REG_CPU0_APB_BASE      MM_MISC_REG_CPU0_APB_BASE
#define MM_MISC_REG_CPU0_APB_BASE_POS  (0U)
#define MM_MISC_REG_CPU0_APB_BASE_LEN  (13U)
#define MM_MISC_REG_CPU0_APB_BASE_MSK  (((1U << MM_MISC_REG_CPU0_APB_BASE_LEN) - 1) << MM_MISC_REG_CPU0_APB_BASE_POS)
#define MM_MISC_REG_CPU0_APB_BASE_UMSK (~(((1U << MM_MISC_REG_CPU0_APB_BASE_LEN) - 1) << MM_MISC_REG_CPU0_APB_BASE_POS))
#define MM_MISC_CPU0_NDM_RSTN_EN       MM_MISC_CPU0_NDM_RSTN_EN
#define MM_MISC_CPU0_NDM_RSTN_EN_POS   (28U)
#define MM_MISC_CPU0_NDM_RSTN_EN_LEN   (1U)
#define MM_MISC_CPU0_NDM_RSTN_EN_MSK   (((1U << MM_MISC_CPU0_NDM_RSTN_EN_LEN) - 1) << MM_MISC_CPU0_NDM_RSTN_EN_POS)
#define MM_MISC_CPU0_NDM_RSTN_EN_UMSK  (~(((1U << MM_MISC_CPU0_NDM_RSTN_EN_LEN) - 1) << MM_MISC_CPU0_NDM_RSTN_EN_POS))
#define MM_MISC_CPU0_HART_RSTN_EN      MM_MISC_CPU0_HART_RSTN_EN
#define MM_MISC_CPU0_HART_RSTN_EN_POS  (29U)
#define MM_MISC_CPU0_HART_RSTN_EN_LEN  (1U)
#define MM_MISC_CPU0_HART_RSTN_EN_MSK  (((1U << MM_MISC_CPU0_HART_RSTN_EN_LEN) - 1) << MM_MISC_CPU0_HART_RSTN_EN_POS)
#define MM_MISC_CPU0_HART_RSTN_EN_UMSK (~(((1U << MM_MISC_CPU0_HART_RSTN_EN_LEN) - 1) << MM_MISC_CPU0_HART_RSTN_EN_POS))

/* 0xC : CPU_sts1 */
#define MM_MISC_CPU_STS1_OFFSET           (0xC)
#define MM_MISC_CPU0_LPMD_B               MM_MISC_CPU0_LPMD_B
#define MM_MISC_CPU0_LPMD_B_POS           (4U)
#define MM_MISC_CPU0_LPMD_B_LEN           (2U)
#define MM_MISC_CPU0_LPMD_B_MSK           (((1U << MM_MISC_CPU0_LPMD_B_LEN) - 1) << MM_MISC_CPU0_LPMD_B_POS)
#define MM_MISC_CPU0_LPMD_B_UMSK          (~(((1U << MM_MISC_CPU0_LPMD_B_LEN) - 1) << MM_MISC_CPU0_LPMD_B_POS))
#define MM_MISC_CPU0_RETIRE_PC_39_32      MM_MISC_CPU0_RETIRE_PC_39_32
#define MM_MISC_CPU0_RETIRE_PC_39_32_POS  (16U)
#define MM_MISC_CPU0_RETIRE_PC_39_32_LEN  (8U)
#define MM_MISC_CPU0_RETIRE_PC_39_32_MSK  (((1U << MM_MISC_CPU0_RETIRE_PC_39_32_LEN) - 1) << MM_MISC_CPU0_RETIRE_PC_39_32_POS)
#define MM_MISC_CPU0_RETIRE_PC_39_32_UMSK (~(((1U << MM_MISC_CPU0_RETIRE_PC_39_32_LEN) - 1) << MM_MISC_CPU0_RETIRE_PC_39_32_POS))
#define MM_MISC_CPU0_RETIRE               MM_MISC_CPU0_RETIRE
#define MM_MISC_CPU0_RETIRE_POS           (24U)
#define MM_MISC_CPU0_RETIRE_LEN           (1U)
#define MM_MISC_CPU0_RETIRE_MSK           (((1U << MM_MISC_CPU0_RETIRE_LEN) - 1) << MM_MISC_CPU0_RETIRE_POS)
#define MM_MISC_CPU0_RETIRE_UMSK          (~(((1U << MM_MISC_CPU0_RETIRE_LEN) - 1) << MM_MISC_CPU0_RETIRE_POS))
#define MM_MISC_CPU0_PAD_HALTED           MM_MISC_CPU0_PAD_HALTED
#define MM_MISC_CPU0_PAD_HALTED_POS       (25U)
#define MM_MISC_CPU0_PAD_HALTED_LEN       (1U)
#define MM_MISC_CPU0_PAD_HALTED_MSK       (((1U << MM_MISC_CPU0_PAD_HALTED_LEN) - 1) << MM_MISC_CPU0_PAD_HALTED_POS)
#define MM_MISC_CPU0_PAD_HALTED_UMSK      (~(((1U << MM_MISC_CPU0_PAD_HALTED_LEN) - 1) << MM_MISC_CPU0_PAD_HALTED_POS))
#define MM_MISC_CPU0_NDM_RSTN_REQ         MM_MISC_CPU0_NDM_RSTN_REQ
#define MM_MISC_CPU0_NDM_RSTN_REQ_POS     (28U)
#define MM_MISC_CPU0_NDM_RSTN_REQ_LEN     (1U)
#define MM_MISC_CPU0_NDM_RSTN_REQ_MSK     (((1U << MM_MISC_CPU0_NDM_RSTN_REQ_LEN) - 1) << MM_MISC_CPU0_NDM_RSTN_REQ_POS)
#define MM_MISC_CPU0_NDM_RSTN_REQ_UMSK    (~(((1U << MM_MISC_CPU0_NDM_RSTN_REQ_LEN) - 1) << MM_MISC_CPU0_NDM_RSTN_REQ_POS))
#define MM_MISC_CPU0_HART_RSTN_REQ        MM_MISC_CPU0_HART_RSTN_REQ
#define MM_MISC_CPU0_HART_RSTN_REQ_POS    (29U)
#define MM_MISC_CPU0_HART_RSTN_REQ_LEN    (1U)
#define MM_MISC_CPU0_HART_RSTN_REQ_MSK    (((1U << MM_MISC_CPU0_HART_RSTN_REQ_LEN) - 1) << MM_MISC_CPU0_HART_RSTN_REQ_POS)
#define MM_MISC_CPU0_HART_RSTN_REQ_UMSK   (~(((1U << MM_MISC_CPU0_HART_RSTN_REQ_LEN) - 1) << MM_MISC_CPU0_HART_RSTN_REQ_POS))

/* 0x10 : CPU_sts2 */
#define MM_MISC_CPU_STS2_OFFSET          (0x10)
#define MM_MISC_CPU0_RETIRE_PC_31_0      MM_MISC_CPU0_RETIRE_PC_31_0
#define MM_MISC_CPU0_RETIRE_PC_31_0_POS  (0U)
#define MM_MISC_CPU0_RETIRE_PC_31_0_LEN  (32U)
#define MM_MISC_CPU0_RETIRE_PC_31_0_MSK  (((1U << MM_MISC_CPU0_RETIRE_PC_31_0_LEN) - 1) << MM_MISC_CPU0_RETIRE_PC_31_0_POS)
#define MM_MISC_CPU0_RETIRE_PC_31_0_UMSK (~(((1U << MM_MISC_CPU0_RETIRE_PC_31_0_LEN) - 1) << MM_MISC_CPU0_RETIRE_PC_31_0_POS))

/* 0x18 : CPU_RTC */
#define MM_MISC_CPU_RTC_OFFSET    (0x18)
#define MM_MISC_C906_RTC_DIV      MM_MISC_C906_RTC_DIV
#define MM_MISC_C906_RTC_DIV_POS  (0U)
#define MM_MISC_C906_RTC_DIV_LEN  (10U)
#define MM_MISC_C906_RTC_DIV_MSK  (((1U << MM_MISC_C906_RTC_DIV_LEN) - 1) << MM_MISC_C906_RTC_DIV_POS)
#define MM_MISC_C906_RTC_DIV_UMSK (~(((1U << MM_MISC_C906_RTC_DIV_LEN) - 1) << MM_MISC_C906_RTC_DIV_POS))
#define MM_MISC_C906_RTC_RST      MM_MISC_C906_RTC_RST
#define MM_MISC_C906_RTC_RST_POS  (30U)
#define MM_MISC_C906_RTC_RST_LEN  (1U)
#define MM_MISC_C906_RTC_RST_MSK  (((1U << MM_MISC_C906_RTC_RST_LEN) - 1) << MM_MISC_C906_RTC_RST_POS)
#define MM_MISC_C906_RTC_RST_UMSK (~(((1U << MM_MISC_C906_RTC_RST_LEN) - 1) << MM_MISC_C906_RTC_RST_POS))
#define MM_MISC_C906_RTC_EN       MM_MISC_C906_RTC_EN
#define MM_MISC_C906_RTC_EN_POS   (31U)
#define MM_MISC_C906_RTC_EN_LEN   (1U)
#define MM_MISC_C906_RTC_EN_MSK   (((1U << MM_MISC_C906_RTC_EN_LEN) - 1) << MM_MISC_C906_RTC_EN_POS)
#define MM_MISC_C906_RTC_EN_UMSK  (~(((1U << MM_MISC_C906_RTC_EN_LEN) - 1) << MM_MISC_C906_RTC_EN_POS))

/* 0x1C : tzc_mmsys_misc */
#define MM_MISC_TZC_MMSYS_MISC_OFFSET (0x1C)
#define MM_MISC_TZC_MM_CPU0_LOCK      MM_MISC_TZC_MM_CPU0_LOCK
#define MM_MISC_TZC_MM_CPU0_LOCK_POS  (0U)
#define MM_MISC_TZC_MM_CPU0_LOCK_LEN  (1U)
#define MM_MISC_TZC_MM_CPU0_LOCK_MSK  (((1U << MM_MISC_TZC_MM_CPU0_LOCK_LEN) - 1) << MM_MISC_TZC_MM_CPU0_LOCK_POS)
#define MM_MISC_TZC_MM_CPU0_LOCK_UMSK (~(((1U << MM_MISC_TZC_MM_CPU0_LOCK_LEN) - 1) << MM_MISC_TZC_MM_CPU0_LOCK_POS))
#define MM_MISC_TZC_MM_SRAM_LOCK      MM_MISC_TZC_MM_SRAM_LOCK
#define MM_MISC_TZC_MM_SRAM_LOCK_POS  (2U)
#define MM_MISC_TZC_MM_SRAM_LOCK_LEN  (1U)
#define MM_MISC_TZC_MM_SRAM_LOCK_MSK  (((1U << MM_MISC_TZC_MM_SRAM_LOCK_LEN) - 1) << MM_MISC_TZC_MM_SRAM_LOCK_POS)
#define MM_MISC_TZC_MM_SRAM_LOCK_UMSK (~(((1U << MM_MISC_TZC_MM_SRAM_LOCK_LEN) - 1) << MM_MISC_TZC_MM_SRAM_LOCK_POS))

/* 0x20 : peri_apb_ctrl */
#define MM_MISC_PERI_APB_CTRL_OFFSET         (0x20)
#define MM_MISC_REG_MMINFRA_BERR_INT_EN      MM_MISC_REG_MMINFRA_BERR_INT_EN
#define MM_MISC_REG_MMINFRA_BERR_INT_EN_POS  (0U)
#define MM_MISC_REG_MMINFRA_BERR_INT_EN_LEN  (1U)
#define MM_MISC_REG_MMINFRA_BERR_INT_EN_MSK  (((1U << MM_MISC_REG_MMINFRA_BERR_INT_EN_LEN) - 1) << MM_MISC_REG_MMINFRA_BERR_INT_EN_POS)
#define MM_MISC_REG_MMINFRA_BERR_INT_EN_UMSK (~(((1U << MM_MISC_REG_MMINFRA_BERR_INT_EN_LEN) - 1) << MM_MISC_REG_MMINFRA_BERR_INT_EN_POS))
#define MM_MISC_REG_ISP_BERR_INT_EN          MM_MISC_REG_ISP_BERR_INT_EN
#define MM_MISC_REG_ISP_BERR_INT_EN_POS      (1U)
#define MM_MISC_REG_ISP_BERR_INT_EN_LEN      (1U)
#define MM_MISC_REG_ISP_BERR_INT_EN_MSK      (((1U << MM_MISC_REG_ISP_BERR_INT_EN_LEN) - 1) << MM_MISC_REG_ISP_BERR_INT_EN_POS)
#define MM_MISC_REG_ISP_BERR_INT_EN_UMSK     (~(((1U << MM_MISC_REG_ISP_BERR_INT_EN_LEN) - 1) << MM_MISC_REG_ISP_BERR_INT_EN_POS))
#define MM_MISC_REG_CODEC_BERR_INT_EN        MM_MISC_REG_CODEC_BERR_INT_EN
#define MM_MISC_REG_CODEC_BERR_INT_EN_POS    (2U)
#define MM_MISC_REG_CODEC_BERR_INT_EN_LEN    (1U)
#define MM_MISC_REG_CODEC_BERR_INT_EN_MSK    (((1U << MM_MISC_REG_CODEC_BERR_INT_EN_LEN) - 1) << MM_MISC_REG_CODEC_BERR_INT_EN_POS)
#define MM_MISC_REG_CODEC_BERR_INT_EN_UMSK   (~(((1U << MM_MISC_REG_CODEC_BERR_INT_EN_LEN) - 1) << MM_MISC_REG_CODEC_BERR_INT_EN_POS))
#define MM_MISC_REG_MMCPU_BERR_INT_EN        MM_MISC_REG_MMCPU_BERR_INT_EN
#define MM_MISC_REG_MMCPU_BERR_INT_EN_POS    (3U)
#define MM_MISC_REG_MMCPU_BERR_INT_EN_LEN    (1U)
#define MM_MISC_REG_MMCPU_BERR_INT_EN_MSK    (((1U << MM_MISC_REG_MMCPU_BERR_INT_EN_LEN) - 1) << MM_MISC_REG_MMCPU_BERR_INT_EN_POS)
#define MM_MISC_REG_MMCPU_BERR_INT_EN_UMSK   (~(((1U << MM_MISC_REG_MMCPU_BERR_INT_EN_LEN) - 1) << MM_MISC_REG_MMCPU_BERR_INT_EN_POS))
#define MM_MISC_REG_MM_X2HS_SP_BYPASS        MM_MISC_REG_MM_X2HS_SP_BYPASS
#define MM_MISC_REG_MM_X2HS_SP_BYPASS_POS    (8U)
#define MM_MISC_REG_MM_X2HS_SP_BYPASS_LEN    (1U)
#define MM_MISC_REG_MM_X2HS_SP_BYPASS_MSK    (((1U << MM_MISC_REG_MM_X2HS_SP_BYPASS_LEN) - 1) << MM_MISC_REG_MM_X2HS_SP_BYPASS_POS)
#define MM_MISC_REG_MM_X2HS_SP_BYPASS_UMSK   (~(((1U << MM_MISC_REG_MM_X2HS_SP_BYPASS_LEN) - 1) << MM_MISC_REG_MM_X2HS_SP_BYPASS_POS))
#define MM_MISC_RG_PCLK_FORCE_ON             MM_MISC_RG_PCLK_FORCE_ON
#define MM_MISC_RG_PCLK_FORCE_ON_POS         (16U)
#define MM_MISC_RG_PCLK_FORCE_ON_LEN         (16U)
#define MM_MISC_RG_PCLK_FORCE_ON_MSK         (((1U << MM_MISC_RG_PCLK_FORCE_ON_LEN) - 1) << MM_MISC_RG_PCLK_FORCE_ON_POS)
#define MM_MISC_RG_PCLK_FORCE_ON_UMSK        (~(((1U << MM_MISC_RG_PCLK_FORCE_ON_LEN) - 1) << MM_MISC_RG_PCLK_FORCE_ON_POS))

/* 0x2C : mm_infra_qos_ctrl */
#define MM_MISC_MM_INFRA_QOS_CTRL_OFFSET  (0x2C)
#define MM_MISC_REG_MMCPU0_AWQOS          MM_MISC_REG_MMCPU0_AWQOS
#define MM_MISC_REG_MMCPU0_AWQOS_POS      (2U)
#define MM_MISC_REG_MMCPU0_AWQOS_LEN      (1U)
#define MM_MISC_REG_MMCPU0_AWQOS_MSK      (((1U << MM_MISC_REG_MMCPU0_AWQOS_LEN) - 1) << MM_MISC_REG_MMCPU0_AWQOS_POS)
#define MM_MISC_REG_MMCPU0_AWQOS_UMSK     (~(((1U << MM_MISC_REG_MMCPU0_AWQOS_LEN) - 1) << MM_MISC_REG_MMCPU0_AWQOS_POS))
#define MM_MISC_REG_MMCPU0_ARQOS          MM_MISC_REG_MMCPU0_ARQOS
#define MM_MISC_REG_MMCPU0_ARQOS_POS      (3U)
#define MM_MISC_REG_MMCPU0_ARQOS_LEN      (1U)
#define MM_MISC_REG_MMCPU0_ARQOS_MSK      (((1U << MM_MISC_REG_MMCPU0_ARQOS_LEN) - 1) << MM_MISC_REG_MMCPU0_ARQOS_POS)
#define MM_MISC_REG_MMCPU0_ARQOS_UMSK     (~(((1U << MM_MISC_REG_MMCPU0_ARQOS_LEN) - 1) << MM_MISC_REG_MMCPU0_ARQOS_POS))
#define MM_MISC_REG_H_WTHRE_MM2CONN       MM_MISC_REG_H_WTHRE_MM2CONN
#define MM_MISC_REG_H_WTHRE_MM2CONN_POS   (16U)
#define MM_MISC_REG_H_WTHRE_MM2CONN_LEN   (2U)
#define MM_MISC_REG_H_WTHRE_MM2CONN_MSK   (((1U << MM_MISC_REG_H_WTHRE_MM2CONN_LEN) - 1) << MM_MISC_REG_H_WTHRE_MM2CONN_POS)
#define MM_MISC_REG_H_WTHRE_MM2CONN_UMSK  (~(((1U << MM_MISC_REG_H_WTHRE_MM2CONN_LEN) - 1) << MM_MISC_REG_H_WTHRE_MM2CONN_POS))
#define MM_MISC_REG_H_WTHRE_CONN2MM       MM_MISC_REG_H_WTHRE_CONN2MM
#define MM_MISC_REG_H_WTHRE_CONN2MM_POS   (18U)
#define MM_MISC_REG_H_WTHRE_CONN2MM_LEN   (2U)
#define MM_MISC_REG_H_WTHRE_CONN2MM_MSK   (((1U << MM_MISC_REG_H_WTHRE_CONN2MM_LEN) - 1) << MM_MISC_REG_H_WTHRE_CONN2MM_POS)
#define MM_MISC_REG_H_WTHRE_CONN2MM_UMSK  (~(((1U << MM_MISC_REG_H_WTHRE_CONN2MM_LEN) - 1) << MM_MISC_REG_H_WTHRE_CONN2MM_POS))
#define MM_MISC_REG_X_WTHRE_MMHW2PA       MM_MISC_REG_X_WTHRE_MMHW2PA
#define MM_MISC_REG_X_WTHRE_MMHW2PA_POS   (20U)
#define MM_MISC_REG_X_WTHRE_MMHW2PA_LEN   (2U)
#define MM_MISC_REG_X_WTHRE_MMHW2PA_MSK   (((1U << MM_MISC_REG_X_WTHRE_MMHW2PA_LEN) - 1) << MM_MISC_REG_X_WTHRE_MMHW2PA_POS)
#define MM_MISC_REG_X_WTHRE_MMHW2PA_UMSK  (~(((1U << MM_MISC_REG_X_WTHRE_MMHW2PA_LEN) - 1) << MM_MISC_REG_X_WTHRE_MMHW2PA_POS))
#define MM_MISC_REG_X_WTHRE_MMHW2EXT      MM_MISC_REG_X_WTHRE_MMHW2EXT
#define MM_MISC_REG_X_WTHRE_MMHW2EXT_POS  (22U)
#define MM_MISC_REG_X_WTHRE_MMHW2EXT_LEN  (2U)
#define MM_MISC_REG_X_WTHRE_MMHW2EXT_MSK  (((1U << MM_MISC_REG_X_WTHRE_MMHW2EXT_LEN) - 1) << MM_MISC_REG_X_WTHRE_MMHW2EXT_POS)
#define MM_MISC_REG_X_WTHRE_MMHW2EXT_UMSK (~(((1U << MM_MISC_REG_X_WTHRE_MMHW2EXT_LEN) - 1) << MM_MISC_REG_X_WTHRE_MMHW2EXT_POS))
#define MM_MISC_REG_X_WTHRE_PUHS          MM_MISC_REG_X_WTHRE_PUHS
#define MM_MISC_REG_X_WTHRE_PUHS_POS      (24U)
#define MM_MISC_REG_X_WTHRE_PUHS_LEN      (2U)
#define MM_MISC_REG_X_WTHRE_PUHS_MSK      (((1U << MM_MISC_REG_X_WTHRE_PUHS_LEN) - 1) << MM_MISC_REG_X_WTHRE_PUHS_POS)
#define MM_MISC_REG_X_WTHRE_PUHS_UMSK     (~(((1U << MM_MISC_REG_X_WTHRE_PUHS_LEN) - 1) << MM_MISC_REG_X_WTHRE_PUHS_POS))

/* 0x40 : dma_clk_ctrl */
#define MM_MISC_DMA_CLK_CTRL_OFFSET (0x40)
#define MM_MISC_DMA_CLK_EN          MM_MISC_DMA_CLK_EN
#define MM_MISC_DMA_CLK_EN_POS      (0U)
#define MM_MISC_DMA_CLK_EN_LEN      (8U)
#define MM_MISC_DMA_CLK_EN_MSK      (((1U << MM_MISC_DMA_CLK_EN_LEN) - 1) << MM_MISC_DMA_CLK_EN_POS)
#define MM_MISC_DMA_CLK_EN_UMSK     (~(((1U << MM_MISC_DMA_CLK_EN_LEN) - 1) << MM_MISC_DMA_CLK_EN_POS))

/* 0x50 : vram_ctrl */
#define MM_MISC_VRAM_CTRL_OFFSET       (0x50)
#define MM_MISC_REG_SYSRAM_SET         MM_MISC_REG_SYSRAM_SET
#define MM_MISC_REG_SYSRAM_SET_POS     (0U)
#define MM_MISC_REG_SYSRAM_SET_LEN     (1U)
#define MM_MISC_REG_SYSRAM_SET_MSK     (((1U << MM_MISC_REG_SYSRAM_SET_LEN) - 1) << MM_MISC_REG_SYSRAM_SET_POS)
#define MM_MISC_REG_SYSRAM_SET_UMSK    (~(((1U << MM_MISC_REG_SYSRAM_SET_LEN) - 1) << MM_MISC_REG_SYSRAM_SET_POS))
#define MM_MISC_REG_H2PF_SRAM_REL      MM_MISC_REG_H2PF_SRAM_REL
#define MM_MISC_REG_H2PF_SRAM_REL_POS  (1U)
#define MM_MISC_REG_H2PF_SRAM_REL_LEN  (2U)
#define MM_MISC_REG_H2PF_SRAM_REL_MSK  (((1U << MM_MISC_REG_H2PF_SRAM_REL_LEN) - 1) << MM_MISC_REG_H2PF_SRAM_REL_POS)
#define MM_MISC_REG_H2PF_SRAM_REL_UMSK (~(((1U << MM_MISC_REG_H2PF_SRAM_REL_LEN) - 1) << MM_MISC_REG_H2PF_SRAM_REL_POS))
#define MM_MISC_REG_VRAM_SRAM_REL      MM_MISC_REG_VRAM_SRAM_REL
#define MM_MISC_REG_VRAM_SRAM_REL_POS  (4U)
#define MM_MISC_REG_VRAM_SRAM_REL_LEN  (1U)
#define MM_MISC_REG_VRAM_SRAM_REL_MSK  (((1U << MM_MISC_REG_VRAM_SRAM_REL_LEN) - 1) << MM_MISC_REG_VRAM_SRAM_REL_POS)
#define MM_MISC_REG_VRAM_SRAM_REL_UMSK (~(((1U << MM_MISC_REG_VRAM_SRAM_REL_LEN) - 1) << MM_MISC_REG_VRAM_SRAM_REL_POS))
#define MM_MISC_REG_ISPL_SRAM_REL      MM_MISC_REG_ISPL_SRAM_REL
#define MM_MISC_REG_ISPL_SRAM_REL_POS  (6U)
#define MM_MISC_REG_ISPL_SRAM_REL_LEN  (1U)
#define MM_MISC_REG_ISPL_SRAM_REL_MSK  (((1U << MM_MISC_REG_ISPL_SRAM_REL_LEN) - 1) << MM_MISC_REG_ISPL_SRAM_REL_POS)
#define MM_MISC_REG_ISPL_SRAM_REL_UMSK (~(((1U << MM_MISC_REG_ISPL_SRAM_REL_LEN) - 1) << MM_MISC_REG_ISPL_SRAM_REL_POS))
#define MM_MISC_REG_BLAI_SRAM_REL      MM_MISC_REG_BLAI_SRAM_REL
#define MM_MISC_REG_BLAI_SRAM_REL_POS  (7U)
#define MM_MISC_REG_BLAI_SRAM_REL_LEN  (1U)
#define MM_MISC_REG_BLAI_SRAM_REL_MSK  (((1U << MM_MISC_REG_BLAI_SRAM_REL_LEN) - 1) << MM_MISC_REG_BLAI_SRAM_REL_POS)
#define MM_MISC_REG_BLAI_SRAM_REL_UMSK (~(((1U << MM_MISC_REG_BLAI_SRAM_REL_LEN) - 1) << MM_MISC_REG_BLAI_SRAM_REL_POS))
#define MM_MISC_REG_H2PF_SRAM_SEL      MM_MISC_REG_H2PF_SRAM_SEL
#define MM_MISC_REG_H2PF_SRAM_SEL_POS  (8U)
#define MM_MISC_REG_H2PF_SRAM_SEL_LEN  (3U)
#define MM_MISC_REG_H2PF_SRAM_SEL_MSK  (((1U << MM_MISC_REG_H2PF_SRAM_SEL_LEN) - 1) << MM_MISC_REG_H2PF_SRAM_SEL_POS)
#define MM_MISC_REG_H2PF_SRAM_SEL_UMSK (~(((1U << MM_MISC_REG_H2PF_SRAM_SEL_LEN) - 1) << MM_MISC_REG_H2PF_SRAM_SEL_POS))
#define MM_MISC_REG_VRAM_SRAM_SEL      MM_MISC_REG_VRAM_SRAM_SEL
#define MM_MISC_REG_VRAM_SRAM_SEL_POS  (12U)
#define MM_MISC_REG_VRAM_SRAM_SEL_LEN  (1U)
#define MM_MISC_REG_VRAM_SRAM_SEL_MSK  (((1U << MM_MISC_REG_VRAM_SRAM_SEL_LEN) - 1) << MM_MISC_REG_VRAM_SRAM_SEL_POS)
#define MM_MISC_REG_VRAM_SRAM_SEL_UMSK (~(((1U << MM_MISC_REG_VRAM_SRAM_SEL_LEN) - 1) << MM_MISC_REG_VRAM_SRAM_SEL_POS))
#define MM_MISC_REG_ISPL_SRAM_SEL      MM_MISC_REG_ISPL_SRAM_SEL
#define MM_MISC_REG_ISPL_SRAM_SEL_POS  (14U)
#define MM_MISC_REG_ISPL_SRAM_SEL_LEN  (1U)
#define MM_MISC_REG_ISPL_SRAM_SEL_MSK  (((1U << MM_MISC_REG_ISPL_SRAM_SEL_LEN) - 1) << MM_MISC_REG_ISPL_SRAM_SEL_POS)
#define MM_MISC_REG_ISPL_SRAM_SEL_UMSK (~(((1U << MM_MISC_REG_ISPL_SRAM_SEL_LEN) - 1) << MM_MISC_REG_ISPL_SRAM_SEL_POS))
#define MM_MISC_REG_BLAI_SRAM_SEL      MM_MISC_REG_BLAI_SRAM_SEL
#define MM_MISC_REG_BLAI_SRAM_SEL_POS  (15U)
#define MM_MISC_REG_BLAI_SRAM_SEL_LEN  (1U)
#define MM_MISC_REG_BLAI_SRAM_SEL_MSK  (((1U << MM_MISC_REG_BLAI_SRAM_SEL_LEN) - 1) << MM_MISC_REG_BLAI_SRAM_SEL_POS)
#define MM_MISC_REG_BLAI_SRAM_SEL_UMSK (~(((1U << MM_MISC_REG_BLAI_SRAM_SEL_LEN) - 1) << MM_MISC_REG_BLAI_SRAM_SEL_POS))

