XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/mm_misc_reg.h
/* 0x60 : sram_parm */
#define MM_MISC_SRAM_PARM_OFFSET           (0x60)
#define MM_MISC_REG_SRAM_CPU_RAM_DVS       MM_MISC_REG_SRAM_CPU_RAM_DVS
#define MM_MISC_REG_SRAM_CPU_RAM_DVS_POS   (0U)
#define MM_MISC_REG_SRAM_CPU_RAM_DVS_LEN   (4U)
#define MM_MISC_REG_SRAM_CPU_RAM_DVS_MSK   (((1U << MM_MISC_REG_SRAM_CPU_RAM_DVS_LEN) - 1) << MM_MISC_REG_SRAM_CPU_RAM_DVS_POS)
#define MM_MISC_REG_SRAM_CPU_RAM_DVS_UMSK  (~(((1U << MM_MISC_REG_SRAM_CPU_RAM_DVS_LEN) - 1) << MM_MISC_REG_SRAM_CPU_RAM_DVS_POS))
#define MM_MISC_REG_SRAM_CPU_RAM_DVSE      MM_MISC_REG_SRAM_CPU_RAM_DVSE
#define MM_MISC_REG_SRAM_CPU_RAM_DVSE_POS  (4U)
#define MM_MISC_REG_SRAM_CPU_RAM_DVSE_LEN  (1U)
#define MM_MISC_REG_SRAM_CPU_RAM_DVSE_MSK  (((1U << MM_MISC_REG_SRAM_CPU_RAM_DVSE_LEN) - 1) << MM_MISC_REG_SRAM_CPU_RAM_DVSE_POS)
#define MM_MISC_REG_SRAM_CPU_RAM_DVSE_UMSK (~(((1U << MM_MISC_REG_SRAM_CPU_RAM_DVSE_LEN) - 1) << MM_MISC_REG_SRAM_CPU_RAM_DVSE_POS))
#define MM_MISC_REG_SRAM_CPU_RAM_NAP       MM_MISC_REG_SRAM_CPU_RAM_NAP
#define MM_MISC_REG_SRAM_CPU_RAM_NAP_POS   (5U)
#define MM_MISC_REG_SRAM_CPU_RAM_NAP_LEN   (1U)
#define MM_MISC_REG_SRAM_CPU_RAM_NAP_MSK   (((1U << MM_MISC_REG_SRAM_CPU_RAM_NAP_LEN) - 1) << MM_MISC_REG_SRAM_CPU_RAM_NAP_POS)
#define MM_MISC_REG_SRAM_CPU_RAM_NAP_UMSK  (~(((1U << MM_MISC_REG_SRAM_CPU_RAM_NAP_LEN) - 1) << MM_MISC_REG_SRAM_CPU_RAM_NAP_POS))
#define MM_MISC_REG_SRAM_L2RAM_DVS         MM_MISC_REG_SRAM_L2RAM_DVS
#define MM_MISC_REG_SRAM_L2RAM_DVS_POS     (8U)
#define MM_MISC_REG_SRAM_L2RAM_DVS_LEN     (4U)
#define MM_MISC_REG_SRAM_L2RAM_DVS_MSK     (((1U << MM_MISC_REG_SRAM_L2RAM_DVS_LEN) - 1) << MM_MISC_REG_SRAM_L2RAM_DVS_POS)
#define MM_MISC_REG_SRAM_L2RAM_DVS_UMSK    (~(((1U << MM_MISC_REG_SRAM_L2RAM_DVS_LEN) - 1) << MM_MISC_REG_SRAM_L2RAM_DVS_POS))
#define MM_MISC_REG_SRAM_L2RAM_DVSE        MM_MISC_REG_SRAM_L2RAM_DVSE
#define MM_MISC_REG_SRAM_L2RAM_DVSE_POS    (12U)
#define MM_MISC_REG_SRAM_L2RAM_DVSE_LEN    (1U)
#define MM_MISC_REG_SRAM_L2RAM_DVSE_MSK    (((1U << MM_MISC_REG_SRAM_L2RAM_DVSE_LEN) - 1) << MM_MISC_REG_SRAM_L2RAM_DVSE_POS)
#define MM_MISC_REG_SRAM_L2RAM_DVSE_UMSK   (~(((1U << MM_MISC_REG_SRAM_L2RAM_DVSE_LEN) - 1) << MM_MISC_REG_SRAM_L2RAM_DVSE_POS))
#define MM_MISC_REG_SRAM_L2RAM_NAP         MM_MISC_REG_SRAM_L2RAM_NAP
#define MM_MISC_REG_SRAM_L2RAM_NAP_POS     (13U)
#define MM_MISC_REG_SRAM_L2RAM_NAP_LEN     (1U)
#define MM_MISC_REG_SRAM_L2RAM_NAP_MSK     (((1U << MM_MISC_REG_SRAM_L2RAM_NAP_LEN) - 1) << MM_MISC_REG_SRAM_L2RAM_NAP_POS)
#define MM_MISC_REG_SRAM_L2RAM_NAP_UMSK    (~(((1U << MM_MISC_REG_SRAM_L2RAM_NAP_LEN) - 1) << MM_MISC_REG_SRAM_L2RAM_NAP_POS))
#define MM_MISC_REG_SRAM_CDC_RAM_DVS       MM_MISC_REG_SRAM_CDC_RAM_DVS
#define MM_MISC_REG_SRAM_CDC_RAM_DVS_POS   (16U)
#define MM_MISC_REG_SRAM_CDC_RAM_DVS_LEN   (4U)
#define MM_MISC_REG_SRAM_CDC_RAM_DVS_MSK   (((1U << MM_MISC_REG_SRAM_CDC_RAM_DVS_LEN) - 1) << MM_MISC_REG_SRAM_CDC_RAM_DVS_POS)
#define MM_MISC_REG_SRAM_CDC_RAM_DVS_UMSK  (~(((1U << MM_MISC_REG_SRAM_CDC_RAM_DVS_LEN) - 1) << MM_MISC_REG_SRAM_CDC_RAM_DVS_POS))
#define MM_MISC_REG_SRAM_CDC_RAM_DVSE      MM_MISC_REG_SRAM_CDC_RAM_DVSE
#define MM_MISC_REG_SRAM_CDC_RAM_DVSE_POS  (20U)
#define MM_MISC_REG_SRAM_CDC_RAM_DVSE_LEN  (1U)
#define MM_MISC_REG_SRAM_CDC_RAM_DVSE_MSK  (((1U << MM_MISC_REG_SRAM_CDC_RAM_DVSE_LEN) - 1) << MM_MISC_REG_SRAM_CDC_RAM_DVSE_POS)
#define MM_MISC_REG_SRAM_CDC_RAM_DVSE_UMSK (~(((1U << MM_MISC_REG_SRAM_CDC_RAM_DVSE_LEN) - 1) << MM_MISC_REG_SRAM_CDC_RAM_DVSE_POS))
#define MM_MISC_REG_SRAM_CDC_RAM_NAP       MM_MISC_REG_SRAM_CDC_RAM_NAP
#define MM_MISC_REG_SRAM_CDC_RAM_NAP_POS   (21U)
#define MM_MISC_REG_SRAM_CDC_RAM_NAP_LEN   (1U)
#define MM_MISC_REG_SRAM_CDC_RAM_NAP_MSK   (((1U << MM_MISC_REG_SRAM_CDC_RAM_NAP_LEN) - 1) << MM_MISC_REG_SRAM_CDC_RAM_NAP_POS)
#define MM_MISC_REG_SRAM_CDC_RAM_NAP_UMSK  (~(((1U << MM_MISC_REG_SRAM_CDC_RAM_NAP_LEN) - 1) << MM_MISC_REG_SRAM_CDC_RAM_NAP_POS))
#define MM_MISC_REG_SRAM_ISP_RAM_DVS       MM_MISC_REG_SRAM_ISP_RAM_DVS
#define MM_MISC_REG_SRAM_ISP_RAM_DVS_POS   (24U)
#define MM_MISC_REG_SRAM_ISP_RAM_DVS_LEN   (4U)
#define MM_MISC_REG_SRAM_ISP_RAM_DVS_MSK   (((1U << MM_MISC_REG_SRAM_ISP_RAM_DVS_LEN) - 1) << MM_MISC_REG_SRAM_ISP_RAM_DVS_POS)
#define MM_MISC_REG_SRAM_ISP_RAM_DVS_UMSK  (~(((1U << MM_MISC_REG_SRAM_ISP_RAM_DVS_LEN) - 1) << MM_MISC_REG_SRAM_ISP_RAM_DVS_POS))
#define MM_MISC_REG_SRAM_ISP_RAM_DVSE      MM_MISC_REG_SRAM_ISP_RAM_DVSE
#define MM_MISC_REG_SRAM_ISP_RAM_DVSE_POS  (28U)
#define MM_MISC_REG_SRAM_ISP_RAM_DVSE_LEN  (1U)
#define MM_MISC_REG_SRAM_ISP_RAM_DVSE_MSK  (((1U << MM_MISC_REG_SRAM_ISP_RAM_DVSE_LEN) - 1) << MM_MISC_REG_SRAM_ISP_RAM_DVSE_POS)
#define MM_MISC_REG_SRAM_ISP_RAM_DVSE_UMSK (~(((1U << MM_MISC_REG_SRAM_ISP_RAM_DVSE_LEN) - 1) << MM_MISC_REG_SRAM_ISP_RAM_DVSE_POS))
#define MM_MISC_REG_SRAM_ISP_RAM_NAP       MM_MISC_REG_SRAM_ISP_RAM_NAP
#define MM_MISC_REG_SRAM_ISP_RAM_NAP_POS   (29U)
#define MM_MISC_REG_SRAM_ISP_RAM_NAP_LEN   (1U)
#define MM_MISC_REG_SRAM_ISP_RAM_NAP_MSK   (((1U << MM_MISC_REG_SRAM_ISP_RAM_NAP_LEN) - 1) << MM_MISC_REG_SRAM_ISP_RAM_NAP_POS)
#define MM_MISC_REG_SRAM_ISP_RAM_NAP_UMSK  (~(((1U << MM_MISC_REG_SRAM_ISP_RAM_NAP_LEN) - 1) << MM_MISC_REG_SRAM_ISP_RAM_NAP_POS))

/* 0xA0 : MM_INT_STA0 */
#define MM_MISC_MM_INT_STA0_OFFSET (0xA0)
#define MM_MISC_MM_INT_STA0        MM_MISC_MM_INT_STA0
#define MM_MISC_MM_INT_STA0_POS    (0U)
#define MM_MISC_MM_INT_STA0_LEN    (32U)
#define MM_MISC_MM_INT_STA0_MSK    (((1U << MM_MISC_MM_INT_STA0_LEN) - 1) << MM_MISC_MM_INT_STA0_POS)
#define MM_MISC_MM_INT_STA0_UMSK   (~(((1U << MM_MISC_MM_INT_STA0_LEN) - 1) << MM_MISC_MM_INT_STA0_POS))

/* 0xA4 : MM_INT_MASK0 */
#define MM_MISC_MM_INT_MASK0_OFFSET (0xA4)
#define MM_MISC_MM_INT_MASK0        MM_MISC_MM_INT_MASK0
#define MM_MISC_MM_INT_MASK0_POS    (0U)
#define MM_MISC_MM_INT_MASK0_LEN    (32U)
#define MM_MISC_MM_INT_MASK0_MSK    (((1U << MM_MISC_MM_INT_MASK0_LEN) - 1) << MM_MISC_MM_INT_MASK0_POS)
#define MM_MISC_MM_INT_MASK0_UMSK   (~(((1U << MM_MISC_MM_INT_MASK0_LEN) - 1) << MM_MISC_MM_INT_MASK0_POS))

/* 0xA8 : MM_INT_CLR_0 */
#define MM_MISC_MM_INT_CLR_0_OFFSET (0xA8)
#define MM_MISC_MM_INT_CLR0         MM_MISC_MM_INT_CLR0
#define MM_MISC_MM_INT_CLR0_POS     (0U)
#define MM_MISC_MM_INT_CLR0_LEN     (32U)
#define MM_MISC_MM_INT_CLR0_MSK     (((1U << MM_MISC_MM_INT_CLR0_LEN) - 1) << MM_MISC_MM_INT_CLR0_POS)
#define MM_MISC_MM_INT_CLR0_UMSK    (~(((1U << MM_MISC_MM_INT_CLR0_LEN) - 1) << MM_MISC_MM_INT_CLR0_POS))

