XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/mm_misc_reg.h
/* 0xAC : MM_INT_STA1 */
#define MM_MISC_MM_INT_STA1_OFFSET (0xAC)
#define MM_MISC_MM_INT_STA1        MM_MISC_MM_INT_STA1
#define MM_MISC_MM_INT_STA1_POS    (0U)
#define MM_MISC_MM_INT_STA1_LEN    (32U)
#define MM_MISC_MM_INT_STA1_MSK    (((1U << MM_MISC_MM_INT_STA1_LEN) - 1) << MM_MISC_MM_INT_STA1_POS)
#define MM_MISC_MM_INT_STA1_UMSK   (~(((1U << MM_MISC_MM_INT_STA1_LEN) - 1) << MM_MISC_MM_INT_STA1_POS))

/* 0xB0 : MM_INT_MASK1 */
#define MM_MISC_MM_INT_MASK1_OFFSET (0xB0)
#define MM_MISC_MM_INT_MASK1        MM_MISC_MM_INT_MASK1
#define MM_MISC_MM_INT_MASK1_POS    (0U)
#define MM_MISC_MM_INT_MASK1_LEN    (32U)
#define MM_MISC_MM_INT_MASK1_MSK    (((1U << MM_MISC_MM_INT_MASK1_LEN) - 1) << MM_MISC_MM_INT_MASK1_POS)
#define MM_MISC_MM_INT_MASK1_UMSK   (~(((1U << MM_MISC_MM_INT_MASK1_LEN) - 1) << MM_MISC_MM_INT_MASK1_POS))

/* 0xB4 : MM_INT_CLR_1 */
#define MM_MISC_MM_INT_CLR_1_OFFSET (0xB4)
#define MM_MISC_MM_INT_CLR1         MM_MISC_MM_INT_CLR1
#define MM_MISC_MM_INT_CLR1_POS     (0U)
#define MM_MISC_MM_INT_CLR1_LEN     (32U)
#define MM_MISC_MM_INT_CLR1_MSK     (((1U << MM_MISC_MM_INT_CLR1_LEN) - 1) << MM_MISC_MM_INT_CLR1_POS)
#define MM_MISC_MM_INT_CLR1_UMSK    (~(((1U << MM_MISC_MM_INT_CLR1_LEN) - 1) << MM_MISC_MM_INT_CLR1_POS))

/* 0xF0 : mmsys_debug_sel */
#define MM_MISC_MMSYS_DEBUG_SEL_OFFSET (0xF0)
#define MM_MISC_MMSYS_DEBUG_SEL        MM_MISC_MMSYS_DEBUG_SEL
#define MM_MISC_MMSYS_DEBUG_SEL_POS    (0U)
#define MM_MISC_MMSYS_DEBUG_SEL_LEN    (4U)
#define MM_MISC_MMSYS_DEBUG_SEL_MSK    (((1U << MM_MISC_MMSYS_DEBUG_SEL_LEN) - 1) << MM_MISC_MMSYS_DEBUG_SEL_POS)
#define MM_MISC_MMSYS_DEBUG_SEL_UMSK   (~(((1U << MM_MISC_MMSYS_DEBUG_SEL_LEN) - 1) << MM_MISC_MMSYS_DEBUG_SEL_POS))

/* 0xFC : mmsys_misc_dummy */
#define MM_MISC_MMSYS_MISC_DUMMY_OFFSET  (0xFC)
#define MM_MISC_PIR_CTRL_O               MM_MISC_PIR_CTRL_O
#define MM_MISC_PIR_CTRL_O_POS           (0U)
#define MM_MISC_PIR_CTRL_O_LEN           (1U)
#define MM_MISC_PIR_CTRL_O_MSK           (((1U << MM_MISC_PIR_CTRL_O_LEN) - 1) << MM_MISC_PIR_CTRL_O_POS)
#define MM_MISC_PIR_CTRL_O_UMSK          (~(((1U << MM_MISC_PIR_CTRL_O_LEN) - 1) << MM_MISC_PIR_CTRL_O_POS))
#define MM_MISC_LIGHT_SENSOR_CTRL_O      MM_MISC_LIGHT_SENSOR_CTRL_O
#define MM_MISC_LIGHT_SENSOR_CTRL_O_POS  (1U)
#define MM_MISC_LIGHT_SENSOR_CTRL_O_LEN  (1U)
#define MM_MISC_LIGHT_SENSOR_CTRL_O_MSK  (((1U << MM_MISC_LIGHT_SENSOR_CTRL_O_LEN) - 1) << MM_MISC_LIGHT_SENSOR_CTRL_O_POS)
#define MM_MISC_LIGHT_SENSOR_CTRL_O_UMSK (~(((1U << MM_MISC_LIGHT_SENSOR_CTRL_O_LEN) - 1) << MM_MISC_LIGHT_SENSOR_CTRL_O_POS))
#define MM_MISC_IR_CUT_CTRL_O            MM_MISC_IR_CUT_CTRL_O
#define MM_MISC_IR_CUT_CTRL_O_POS        (2U)
#define MM_MISC_IR_CUT_CTRL_O_LEN        (1U)
#define MM_MISC_IR_CUT_CTRL_O_MSK        (((1U << MM_MISC_IR_CUT_CTRL_O_LEN) - 1) << MM_MISC_IR_CUT_CTRL_O_POS)
#define MM_MISC_IR_CUT_CTRL_O_UMSK       (~(((1U << MM_MISC_IR_CUT_CTRL_O_LEN) - 1) << MM_MISC_IR_CUT_CTRL_O_POS))
#define MM_MISC_DVP_SENSOR_PWDN          MM_MISC_DVP_SENSOR_PWDN
#define MM_MISC_DVP_SENSOR_PWDN_POS      (3U)
#define MM_MISC_DVP_SENSOR_PWDN_LEN      (1U)
#define MM_MISC_DVP_SENSOR_PWDN_MSK      (((1U << MM_MISC_DVP_SENSOR_PWDN_LEN) - 1) << MM_MISC_DVP_SENSOR_PWDN_POS)
#define MM_MISC_DVP_SENSOR_PWDN_UMSK     (~(((1U << MM_MISC_DVP_SENSOR_PWDN_LEN) - 1) << MM_MISC_DVP_SENSOR_PWDN_POS))
#define MM_MISC_DUMMY_REG                MM_MISC_DUMMY_REG
#define MM_MISC_DUMMY_REG_POS            (4U)
#define MM_MISC_DUMMY_REG_LEN            (28U)
#define MM_MISC_DUMMY_REG_MSK            (((1U << MM_MISC_DUMMY_REG_LEN) - 1) << MM_MISC_DUMMY_REG_POS)
#define MM_MISC_DUMMY_REG_UMSK           (~(((1U << MM_MISC_DUMMY_REG_LEN) - 1) << MM_MISC_DUMMY_REG_POS))

/* 0x100 : DDR_debug */
#define MM_MISC_DDR_DEBUG_OFFSET    (0x100)
#define MM_MISC_DDR_CALIB_DONE      MM_MISC_DDR_CALIB_DONE
#define MM_MISC_DDR_CALIB_DONE_POS  (0U)
#define MM_MISC_DDR_CALIB_DONE_LEN  (1U)
#define MM_MISC_DDR_CALIB_DONE_MSK  (((1U << MM_MISC_DDR_CALIB_DONE_LEN) - 1) << MM_MISC_DDR_CALIB_DONE_POS)
#define MM_MISC_DDR_CALIB_DONE_UMSK (~(((1U << MM_MISC_DDR_CALIB_DONE_LEN) - 1) << MM_MISC_DDR_CALIB_DONE_POS))

/* 0x140 : mm_berr_cfg0 */
#define MM_MISC_MM_BERR_CFG0_OFFSET      (0x140)
#define MM_MISC_REG_ISP_BERR_EN          MM_MISC_REG_ISP_BERR_EN
#define MM_MISC_REG_ISP_BERR_EN_POS      (0U)
#define MM_MISC_REG_ISP_BERR_EN_LEN      (3U)
#define MM_MISC_REG_ISP_BERR_EN_MSK      (((1U << MM_MISC_REG_ISP_BERR_EN_LEN) - 1) << MM_MISC_REG_ISP_BERR_EN_POS)
#define MM_MISC_REG_ISP_BERR_EN_UMSK     (~(((1U << MM_MISC_REG_ISP_BERR_EN_LEN) - 1) << MM_MISC_REG_ISP_BERR_EN_POS))
#define MM_MISC_REG_CODEC_BERR_EN        MM_MISC_REG_CODEC_BERR_EN
#define MM_MISC_REG_CODEC_BERR_EN_POS    (8U)
#define MM_MISC_REG_CODEC_BERR_EN_LEN    (3U)
#define MM_MISC_REG_CODEC_BERR_EN_MSK    (((1U << MM_MISC_REG_CODEC_BERR_EN_LEN) - 1) << MM_MISC_REG_CODEC_BERR_EN_POS)
#define MM_MISC_REG_CODEC_BERR_EN_UMSK   (~(((1U << MM_MISC_REG_CODEC_BERR_EN_LEN) - 1) << MM_MISC_REG_CODEC_BERR_EN_POS))
#define MM_MISC_REG_MMCPU_BERR_EN        MM_MISC_REG_MMCPU_BERR_EN
#define MM_MISC_REG_MMCPU_BERR_EN_POS    (16U)
#define MM_MISC_REG_MMCPU_BERR_EN_LEN    (1U)
#define MM_MISC_REG_MMCPU_BERR_EN_MSK    (((1U << MM_MISC_REG_MMCPU_BERR_EN_LEN) - 1) << MM_MISC_REG_MMCPU_BERR_EN_POS)
#define MM_MISC_REG_MMCPU_BERR_EN_UMSK   (~(((1U << MM_MISC_REG_MMCPU_BERR_EN_LEN) - 1) << MM_MISC_REG_MMCPU_BERR_EN_POS))
#define MM_MISC_REG_MMINFRA_BERR_EN      MM_MISC_REG_MMINFRA_BERR_EN
#define MM_MISC_REG_MMINFRA_BERR_EN_POS  (24U)
#define MM_MISC_REG_MMINFRA_BERR_EN_LEN  (5U)
#define MM_MISC_REG_MMINFRA_BERR_EN_MSK  (((1U << MM_MISC_REG_MMINFRA_BERR_EN_LEN) - 1) << MM_MISC_REG_MMINFRA_BERR_EN_POS)
#define MM_MISC_REG_MMINFRA_BERR_EN_UMSK (~(((1U << MM_MISC_REG_MMINFRA_BERR_EN_LEN) - 1) << MM_MISC_REG_MMINFRA_BERR_EN_POS))

/* 0x144 : mm_berr_cfg1 */
#define MM_MISC_MM_BERR_CFG1_OFFSET         (0x144)
#define MM_MISC_REG_ISP_BERR_CLR            MM_MISC_REG_ISP_BERR_CLR
#define MM_MISC_REG_ISP_BERR_CLR_POS        (0U)
#define MM_MISC_REG_ISP_BERR_CLR_LEN        (1U)
#define MM_MISC_REG_ISP_BERR_CLR_MSK        (((1U << MM_MISC_REG_ISP_BERR_CLR_LEN) - 1) << MM_MISC_REG_ISP_BERR_CLR_POS)
#define MM_MISC_REG_ISP_BERR_CLR_UMSK       (~(((1U << MM_MISC_REG_ISP_BERR_CLR_LEN) - 1) << MM_MISC_REG_ISP_BERR_CLR_POS))
#define MM_MISC_REG_CODEC_BERR_CLR          MM_MISC_REG_CODEC_BERR_CLR
#define MM_MISC_REG_CODEC_BERR_CLR_POS      (1U)
#define MM_MISC_REG_CODEC_BERR_CLR_LEN      (1U)
#define MM_MISC_REG_CODEC_BERR_CLR_MSK      (((1U << MM_MISC_REG_CODEC_BERR_CLR_LEN) - 1) << MM_MISC_REG_CODEC_BERR_CLR_POS)
#define MM_MISC_REG_CODEC_BERR_CLR_UMSK     (~(((1U << MM_MISC_REG_CODEC_BERR_CLR_LEN) - 1) << MM_MISC_REG_CODEC_BERR_CLR_POS))
#define MM_MISC_REG_MMCPU_BERR_CLR          MM_MISC_REG_MMCPU_BERR_CLR
#define MM_MISC_REG_MMCPU_BERR_CLR_POS      (2U)
#define MM_MISC_REG_MMCPU_BERR_CLR_LEN      (1U)
#define MM_MISC_REG_MMCPU_BERR_CLR_MSK      (((1U << MM_MISC_REG_MMCPU_BERR_CLR_LEN) - 1) << MM_MISC_REG_MMCPU_BERR_CLR_POS)
#define MM_MISC_REG_MMCPU_BERR_CLR_UMSK     (~(((1U << MM_MISC_REG_MMCPU_BERR_CLR_LEN) - 1) << MM_MISC_REG_MMCPU_BERR_CLR_POS))
#define MM_MISC_REG_MMINFRA_BERR_CLR        MM_MISC_REG_MMINFRA_BERR_CLR
#define MM_MISC_REG_MMINFRA_BERR_CLR_POS    (3U)
#define MM_MISC_REG_MMINFRA_BERR_CLR_LEN    (1U)
#define MM_MISC_REG_MMINFRA_BERR_CLR_MSK    (((1U << MM_MISC_REG_MMINFRA_BERR_CLR_LEN) - 1) << MM_MISC_REG_MMINFRA_BERR_CLR_POS)
#define MM_MISC_REG_MMINFRA_BERR_CLR_UMSK   (~(((1U << MM_MISC_REG_MMINFRA_BERR_CLR_LEN) - 1) << MM_MISC_REG_MMINFRA_BERR_CLR_POS))
#define MM_MISC_REG_ISP_BERR_LAST           MM_MISC_REG_ISP_BERR_LAST
#define MM_MISC_REG_ISP_BERR_LAST_POS       (8U)
#define MM_MISC_REG_ISP_BERR_LAST_LEN       (1U)
#define MM_MISC_REG_ISP_BERR_LAST_MSK       (((1U << MM_MISC_REG_ISP_BERR_LAST_LEN) - 1) << MM_MISC_REG_ISP_BERR_LAST_POS)
#define MM_MISC_REG_ISP_BERR_LAST_UMSK      (~(((1U << MM_MISC_REG_ISP_BERR_LAST_LEN) - 1) << MM_MISC_REG_ISP_BERR_LAST_POS))
#define MM_MISC_REG_CODEC_BERR_LAST         MM_MISC_REG_CODEC_BERR_LAST
#define MM_MISC_REG_CODEC_BERR_LAST_POS     (9U)
#define MM_MISC_REG_CODEC_BERR_LAST_LEN     (1U)
#define MM_MISC_REG_CODEC_BERR_LAST_MSK     (((1U << MM_MISC_REG_CODEC_BERR_LAST_LEN) - 1) << MM_MISC_REG_CODEC_BERR_LAST_POS)
#define MM_MISC_REG_CODEC_BERR_LAST_UMSK    (~(((1U << MM_MISC_REG_CODEC_BERR_LAST_LEN) - 1) << MM_MISC_REG_CODEC_BERR_LAST_POS))
#define MM_MISC_REG_MMCPU_BERR_LAST         MM_MISC_REG_MMCPU_BERR_LAST
#define MM_MISC_REG_MMCPU_BERR_LAST_POS     (10U)
#define MM_MISC_REG_MMCPU_BERR_LAST_LEN     (1U)
#define MM_MISC_REG_MMCPU_BERR_LAST_MSK     (((1U << MM_MISC_REG_MMCPU_BERR_LAST_LEN) - 1) << MM_MISC_REG_MMCPU_BERR_LAST_POS)
#define MM_MISC_REG_MMCPU_BERR_LAST_UMSK    (~(((1U << MM_MISC_REG_MMCPU_BERR_LAST_LEN) - 1) << MM_MISC_REG_MMCPU_BERR_LAST_POS))
#define MM_MISC_REG_MMINFRA_BERR_LAST       MM_MISC_REG_MMINFRA_BERR_LAST
#define MM_MISC_REG_MMINFRA_BERR_LAST_POS   (11U)
#define MM_MISC_REG_MMINFRA_BERR_LAST_LEN   (1U)
#define MM_MISC_REG_MMINFRA_BERR_LAST_MSK   (((1U << MM_MISC_REG_MMINFRA_BERR_LAST_LEN) - 1) << MM_MISC_REG_MMINFRA_BERR_LAST_POS)
#define MM_MISC_REG_MMINFRA_BERR_LAST_UMSK  (~(((1U << MM_MISC_REG_MMINFRA_BERR_LAST_LEN) - 1) << MM_MISC_REG_MMINFRA_BERR_LAST_POS))
#define MM_MISC_STS_ISP_BERR                MM_MISC_STS_ISP_BERR
#define MM_MISC_STS_ISP_BERR_POS            (16U)
#define MM_MISC_STS_ISP_BERR_LEN            (1U)
#define MM_MISC_STS_ISP_BERR_MSK            (((1U << MM_MISC_STS_ISP_BERR_LEN) - 1) << MM_MISC_STS_ISP_BERR_POS)
#define MM_MISC_STS_ISP_BERR_UMSK           (~(((1U << MM_MISC_STS_ISP_BERR_LEN) - 1) << MM_MISC_STS_ISP_BERR_POS))
#define MM_MISC_STS_CODEC_BERR              MM_MISC_STS_CODEC_BERR
#define MM_MISC_STS_CODEC_BERR_POS          (17U)
#define MM_MISC_STS_CODEC_BERR_LEN          (1U)
#define MM_MISC_STS_CODEC_BERR_MSK          (((1U << MM_MISC_STS_CODEC_BERR_LEN) - 1) << MM_MISC_STS_CODEC_BERR_POS)
#define MM_MISC_STS_CODEC_BERR_UMSK         (~(((1U << MM_MISC_STS_CODEC_BERR_LEN) - 1) << MM_MISC_STS_CODEC_BERR_POS))
#define MM_MISC_STS_MMCPU_BERR              MM_MISC_STS_MMCPU_BERR
#define MM_MISC_STS_MMCPU_BERR_POS          (18U)
#define MM_MISC_STS_MMCPU_BERR_LEN          (1U)
#define MM_MISC_STS_MMCPU_BERR_MSK          (((1U << MM_MISC_STS_MMCPU_BERR_LEN) - 1) << MM_MISC_STS_MMCPU_BERR_POS)
#define MM_MISC_STS_MMCPU_BERR_UMSK         (~(((1U << MM_MISC_STS_MMCPU_BERR_LEN) - 1) << MM_MISC_STS_MMCPU_BERR_POS))
#define MM_MISC_STS_MMINFRA_BERR            MM_MISC_STS_MMINFRA_BERR
#define MM_MISC_STS_MMINFRA_BERR_POS        (19U)
#define MM_MISC_STS_MMINFRA_BERR_LEN        (1U)
#define MM_MISC_STS_MMINFRA_BERR_MSK        (((1U << MM_MISC_STS_MMINFRA_BERR_LEN) - 1) << MM_MISC_STS_MMINFRA_BERR_POS)
#define MM_MISC_STS_MMINFRA_BERR_UMSK       (~(((1U << MM_MISC_STS_MMINFRA_BERR_LEN) - 1) << MM_MISC_STS_MMINFRA_BERR_POS))
#define MM_MISC_STS_ISP_BERR_WRITE          MM_MISC_STS_ISP_BERR_WRITE
#define MM_MISC_STS_ISP_BERR_WRITE_POS      (24U)
#define MM_MISC_STS_ISP_BERR_WRITE_LEN      (1U)
#define MM_MISC_STS_ISP_BERR_WRITE_MSK      (((1U << MM_MISC_STS_ISP_BERR_WRITE_LEN) - 1) << MM_MISC_STS_ISP_BERR_WRITE_POS)
#define MM_MISC_STS_ISP_BERR_WRITE_UMSK     (~(((1U << MM_MISC_STS_ISP_BERR_WRITE_LEN) - 1) << MM_MISC_STS_ISP_BERR_WRITE_POS))
#define MM_MISC_STS_CODEC_BERR_WRITE        MM_MISC_STS_CODEC_BERR_WRITE
#define MM_MISC_STS_CODEC_BERR_WRITE_POS    (25U)
#define MM_MISC_STS_CODEC_BERR_WRITE_LEN    (1U)
#define MM_MISC_STS_CODEC_BERR_WRITE_MSK    (((1U << MM_MISC_STS_CODEC_BERR_WRITE_LEN) - 1) << MM_MISC_STS_CODEC_BERR_WRITE_POS)
#define MM_MISC_STS_CODEC_BERR_WRITE_UMSK   (~(((1U << MM_MISC_STS_CODEC_BERR_WRITE_LEN) - 1) << MM_MISC_STS_CODEC_BERR_WRITE_POS))
#define MM_MISC_STS_MMCPU_BERR_WRITE        MM_MISC_STS_MMCPU_BERR_WRITE
#define MM_MISC_STS_MMCPU_BERR_WRITE_POS    (26U)
#define MM_MISC_STS_MMCPU_BERR_WRITE_LEN    (1U)
#define MM_MISC_STS_MMCPU_BERR_WRITE_MSK    (((1U << MM_MISC_STS_MMCPU_BERR_WRITE_LEN) - 1) << MM_MISC_STS_MMCPU_BERR_WRITE_POS)
#define MM_MISC_STS_MMCPU_BERR_WRITE_UMSK   (~(((1U << MM_MISC_STS_MMCPU_BERR_WRITE_LEN) - 1) << MM_MISC_STS_MMCPU_BERR_WRITE_POS))
#define MM_MISC_STS_MMINFRA_BERR_WRITE      MM_MISC_STS_MMINFRA_BERR_WRITE
#define MM_MISC_STS_MMINFRA_BERR_WRITE_POS  (27U)
#define MM_MISC_STS_MMINFRA_BERR_WRITE_LEN  (1U)
#define MM_MISC_STS_MMINFRA_BERR_WRITE_MSK  (((1U << MM_MISC_STS_MMINFRA_BERR_WRITE_LEN) - 1) << MM_MISC_STS_MMINFRA_BERR_WRITE_POS)
#define MM_MISC_STS_MMINFRA_BERR_WRITE_UMSK (~(((1U << MM_MISC_STS_MMINFRA_BERR_WRITE_LEN) - 1) << MM_MISC_STS_MMINFRA_BERR_WRITE_POS))

