XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/mm_misc_reg.h
    /* 0x30  reserved */
    uint8_t RESERVED0x30[16];

    /* 0x40 : dma_clk_ctrl */
    union {
        struct {
            uint32_t dma_clk_en    : 8;  /* [ 7: 0],        r/w,       0xff */
            uint32_t reserved_8_31 : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dma_clk_ctrl;

    /* 0x44  reserved */
    uint8_t RESERVED0x44[12];

    /* 0x50 : vram_ctrl */
    union {
        struct {
            uint32_t reg_sysram_set    : 1;  /* [    0],        w1p,        0x0 */
            uint32_t reg_h2pf_sram_rel : 2;  /* [ 2: 1],        r/w,        0x0 */
            uint32_t reserved_3        : 1;  /* [    3],       rsvd,        0x0 */
            uint32_t reg_vram_sram_rel : 1;  /* [    4],        r/w,        0x0 */
            uint32_t reserved_5        : 1;  /* [    5],       rsvd,        0x0 */
            uint32_t reg_ispl_sram_rel : 1;  /* [    6],        r/w,        0x0 */
            uint32_t reg_blai_sram_rel : 1;  /* [    7],        r/w,        0x0 */
            uint32_t reg_h2pf_sram_sel : 3;  /* [10: 8],          r,        0x0 */
            uint32_t reserved_11       : 1;  /* [   11],       rsvd,        0x0 */
            uint32_t reg_vram_sram_sel : 1;  /* [   12],          r,        0x0 */
            uint32_t reserved_13       : 1;  /* [   13],       rsvd,        0x0 */
            uint32_t reg_ispl_sram_sel : 1;  /* [   14],          r,        0x0 */
            uint32_t reg_blai_sram_sel : 1;  /* [   15],          r,        0x0 */
            uint32_t reserved_16_31    : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } vram_ctrl;

    /* 0x54  reserved */
    uint8_t RESERVED0x54[12];

    /* 0x60 : sram_parm */
    union {
        struct {
            uint32_t reg_sram_cpu_ram_dvs  : 4; /* [ 3: 0],        r/w,        0xc */
            uint32_t reg_sram_cpu_ram_dvse : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_sram_cpu_ram_nap  : 1; /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_7          : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t reg_sram_l2ram_dvs    : 4; /* [11: 8],        r/w,        0xc */
            uint32_t reg_sram_l2ram_dvse   : 1; /* [   12],        r/w,        0x0 */
            uint32_t reg_sram_l2ram_nap    : 1; /* [   13],        r/w,        0x0 */
            uint32_t reserved_14_15        : 2; /* [15:14],       rsvd,        0x0 */
            uint32_t reg_sram_cdc_ram_dvs  : 4; /* [19:16],        r/w,        0xc */
            uint32_t reg_sram_cdc_ram_dvse : 1; /* [   20],        r/w,        0x0 */
            uint32_t reg_sram_cdc_ram_nap  : 1; /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_23        : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t reg_sram_isp_ram_dvs  : 4; /* [27:24],        r/w,        0xc */
            uint32_t reg_sram_isp_ram_dvse : 1; /* [   28],        r/w,        0x0 */
            uint32_t reg_sram_isp_ram_nap  : 1; /* [   29],        r/w,        0x0 */
            uint32_t reserved_30_31        : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } sram_parm;

    /* 0x64  reserved */
    uint8_t RESERVED0x64[60];

    /* 0xA0 : MM_INT_STA0 */
    union {
        struct {
            uint32_t mm_int_sta0 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } MM_INT_STA0;

    /* 0xA4 : MM_INT_MASK0 */
    union {
        struct {
            uint32_t mm_int_mask0 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } MM_INT_MASK0;

    /* 0xA8 : MM_INT_CLR_0 */
    union {
        struct {
            uint32_t mm_int_clr0 : 32; /* [31: 0],        w1p,        0x0 */
        } BF;
        uint32_t WORD;
    } MM_INT_CLR_0;

    /* 0xAC : MM_INT_STA1 */
    union {
        struct {
            uint32_t mm_int_sta1 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } MM_INT_STA1;

    /* 0xB0 : MM_INT_MASK1 */
    union {
        struct {
            uint32_t mm_int_mask1 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } MM_INT_MASK1;

    /* 0xB4 : MM_INT_CLR_1 */
    union {
        struct {
            uint32_t mm_int_clr1 : 32; /* [31: 0],        w1p,        0x0 */
        } BF;
        uint32_t WORD;
    } MM_INT_CLR_1;

    /* 0xb8  reserved */
    uint8_t RESERVED0xb8[56];

    /* 0xF0 : mmsys_debug_sel */
    union {
        struct {
            uint32_t mmsys_debug_sel : 4;  /* [ 3: 0],        r/w,        0x0 */
            uint32_t reserved_4_31   : 28; /* [31: 4],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mmsys_debug_sel;

    /* 0xf4  reserved */
    uint8_t RESERVED0xf4[8];

    /* 0xFC : mmsys_misc_dummy */
    union {
        struct {
            uint32_t PIR_ctrl_o          : 1;  /* [    0],        r/w,        0x0 */
            uint32_t Light_sensor_ctrl_o : 1;  /* [    1],        r/w,        0x0 */
            uint32_t IR_cut_ctrl_o       : 1;  /* [    2],        r/w,        0x0 */
            uint32_t dvp_sensor_pwdn     : 1;  /* [    3],        r/w,        0x0 */
            uint32_t dummy_reg           : 28; /* [31: 4],        r/w,  0xfff0000 */
        } BF;
        uint32_t WORD;
    } mmsys_misc_dummy;

    /* 0x100 : DDR_debug */
    union {
        struct {
            uint32_t ddr_calib_done : 1;  /* [    0],          r,        0x0 */
            uint32_t reserved_1_31  : 31; /* [31: 1],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } DDR_debug;

    /* 0x104  reserved */
    uint8_t RESERVED0x104[60];

    /* 0x140 : mm_berr_cfg0 */
    union {
        struct {
            uint32_t reg_isp_berr_en     : 3; /* [ 2: 0],        r/w,        0x7 */
            uint32_t reserved_3_7        : 5; /* [ 7: 3],       rsvd,        0x0 */
            uint32_t reg_codec_berr_en   : 3; /* [10: 8],        r/w,        0x7 */
            uint32_t reserved_11_15      : 5; /* [15:11],       rsvd,        0x0 */
            uint32_t reg_mmcpu_berr_en   : 1; /* [   16],        r/w,        0x1 */
            uint32_t reserved_17_23      : 7; /* [23:17],       rsvd,        0x0 */
            uint32_t reg_mminfra_berr_en : 5; /* [28:24],        r/w,       0x1f */
            uint32_t reserved_29_31      : 3; /* [31:29],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mm_berr_cfg0;

    /* 0x144 : mm_berr_cfg1 */
    union {
        struct {
            uint32_t reg_isp_berr_clr       : 1; /* [    0],        r/w,        0x0 */
            uint32_t reg_codec_berr_clr     : 1; /* [    1],        r/w,        0x0 */
            uint32_t reg_mmcpu_berr_clr     : 1; /* [    2],        r/w,        0x0 */
            uint32_t reg_mminfra_berr_clr   : 1; /* [    3],        r/w,        0x0 */
            uint32_t reserved_4_7           : 4; /* [ 7: 4],       rsvd,        0x0 */
            uint32_t reg_isp_berr_last      : 1; /* [    8],        r/w,        0x0 */
            uint32_t reg_codec_berr_last    : 1; /* [    9],        r/w,        0x0 */
            uint32_t reg_mmcpu_berr_last    : 1; /* [   10],        r/w,        0x0 */
            uint32_t reg_mminfra_berr_last  : 1; /* [   11],        r/w,        0x0 */
            uint32_t reserved_12_15         : 4; /* [15:12],       rsvd,        0x0 */
            uint32_t sts_isp_berr           : 1; /* [   16],          r,        0x0 */
            uint32_t sts_codec_berr         : 1; /* [   17],          r,        0x0 */
            uint32_t sts_mmcpu_berr         : 1; /* [   18],          r,        0x0 */
            uint32_t sts_mminfra_berr       : 1; /* [   19],          r,        0x0 */
            uint32_t reserved_20_23         : 4; /* [23:20],       rsvd,        0x0 */
            uint32_t sts_isp_berr_write     : 1; /* [   24],          r,        0x0 */
            uint32_t sts_codec_berr_write   : 1; /* [   25],          r,        0x0 */
            uint32_t sts_mmcpu_berr_write   : 1; /* [   26],          r,        0x0 */
            uint32_t sts_mminfra_berr_write : 1; /* [   27],          r,        0x0 */
            uint32_t reserved_28_31         : 4; /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mm_berr_cfg1;

