XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/mm_misc_reg.h
    /* 0x148 : mm_berr_cfg2 */
    union {
        struct {
            uint32_t sts_isp_berr_src   : 3; /* [ 2: 0],          r,        0x0 */
            uint32_t reserved_3_7       : 5; /* [ 7: 3],       rsvd,        0x0 */
            uint32_t sts_isp_berr_id    : 4; /* [11: 8],          r,        0x0 */
            uint32_t reserved_12_15     : 4; /* [15:12],       rsvd,        0x0 */
            uint32_t sts_codec_berr_src : 3; /* [18:16],          r,        0x0 */
            uint32_t reserved_19_23     : 5; /* [23:19],       rsvd,        0x0 */
            uint32_t sts_codec_berr_id  : 1; /* [   24],          r,        0x0 */
            uint32_t reserved_25_31     : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mm_berr_cfg2;

    /* 0x14C : mm_berr_cfg3 */
    union {
        struct {
            uint32_t sts_mmcpu_berr_src   : 1; /* [    0],          r,        0x0 */
            uint32_t reserved_1_7         : 7; /* [ 7: 1],       rsvd,        0x0 */
            uint32_t sts_mmcpu_berr_id    : 4; /* [11: 8],          r,        0x0 */
            uint32_t reserved_12_15       : 4; /* [15:12],       rsvd,        0x0 */
            uint32_t sts_mminfra_berr_src : 5; /* [20:16],          r,        0x0 */
            uint32_t reserved_21_23       : 3; /* [23:21],       rsvd,        0x0 */
            uint32_t sts_mminfra_berr_id  : 6; /* [29:24],          r,        0x0 */
            uint32_t reserved_30_31       : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mm_berr_cfg3;

    /* 0x150 : mm_berr_cfg4 */
    union {
        struct {
            uint32_t sts_isp_berr_addr : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } mm_berr_cfg4;

    /* 0x154 : mm_berr_cfg5 */
    union {
        struct {
            uint32_t sts_codec_berr_addr : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } mm_berr_cfg5;

    /* 0x158 : mm_berr_cfg6 */
    union {
        struct {
            uint32_t sts_mmcpu_berr_addr : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } mm_berr_cfg6;

    /* 0x15C : mm_berr_cfg7 */
    union {
        struct {
            uint32_t sts_mminfra_berr_addr : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } mm_berr_cfg7;
};

typedef volatile struct mm_misc_reg mm_misc_reg_t;

#endif /* __MM_MISC_REG_H__ */
